{
    "Aloevera": "Aloe vera is a succulent plant species that is widely cultivated for its gel, which is commonly used in various skin and health products. It is known for its medicinal properties and is used to treat burns, wounds, and skin irritations.",
    "Amla": "Amla, also known as Indian gooseberry, is a small tree native to India. Its fruit is highly nutritious and is a rich source of vitamin C and antioxidants. Amla is used in Ayurvedic medicine to improve digestion, boost immunity, and promote hair growth.",
    "Amruthaballi": "Amruthaballi, commonly known as Giloy or Tinospora cordifolia, is a herbaceous vine native to the Indian subcontinent. It is valued in Ayurvedic medicine for its immunomodulatory properties and is used to boost immunity, treat fever, and manage diabetes.",
    "Arali": "Arali, also known as Aralia elata, is a species of flowering plant native to East Asia. It is a deciduous shrub that produces clusters of small white flowers followed by dark purple berries. Arali is valued for its ornamental qualities in gardens and landscapes.",
    "Astma_weed": "Astma weed, scientifically known as Euphorbia hirta, is a medicinal herb native to tropical regions. It is used in traditional medicine to treat respiratory conditions such as asthma, bronchitis, and coughs. Asthma weed has expectorant and bronchodilator properties.",
    "Badipala": "Badipala, commonly known as Pongamia pinnata or Indian beech, is a medium-sized tree native to India. It produces clusters of white, pink, or purple flowers followed by brown seed pods. Badipala seeds yield oil used in biodiesel production and traditional medicine.",
    "Balloon_Vine": "Balloon vine, also known as Cardiospermum halicacabum, is a climbing plant native to tropical regions. It is characterized by its inflated seed pods, which resemble balloons. Balloon vine is used in traditional medicine to treat skin conditions and rheumatic pain.",
    "Bamboo": "Bamboo is a group of woody perennial grasses native to various regions around the world. It is known for its rapid growth and versatility, with numerous uses ranging from construction and furniture making to culinary purposes and ornamental gardening.",
    "Beans": "Beans are a type of legume plant that belong to the Fabaceae family. They are grown for their edible seeds, which come in a variety of shapes, sizes, and colors. Beans are valued for their high protein and fiber content, as well as their versatility in cooking.",
    "Betel": "Betel, also known as Piper betle, is a perennial vine cultivated in Southeast Asia. It is valued for its leaves, which are chewed either alone or with other ingredients in betel quid preparations. Betel chewing is a cultural tradition with stimulant and medicinal properties.",
    "Bhrami": "Bhrami, also known as Bacopa monnieri or water hyssop, is a creeping herb native to wetlands and marshy areas. It is valued in Ayurvedic medicine for its cognitive-enhancing properties and is used to improve memory, reduce anxiety, and promote overall mental health.",
    "Bringaraja": "Bringaraja, commonly known as Eclipta prostrata or false daisy, is a herbaceous plant native to tropical and subtropical regions. It is used in traditional medicine to promote hair growth, improve liver function, and treat skin conditions such as eczema and dermatitis.",
    "Caricature": "Caricature, also known as Graptophyllum pictum or caricature plant, is a species of flowering plant native to Southeast Asia. It is cultivated for its colorful foliage, which features variegated patterns of green, yellow, pink, and red. Caricature is grown as an ornamental plant in gardens and landscapes.",
    "Castor": "Castor, also known as Ricinus communis, is a fast-growing shrub native to the Mediterranean region. It produces large, palmately lobed leaves and spiny seed capsules that contain highly toxic seeds. Castor oil extracted from the seeds is used in industry and traditional medicine.",
    "Catharanthus": "Catharanthus, commonly known as Catharanthus roseus or Madagascar periwinkle, is a flowering plant native to Madagascar. It is cultivated for its attractive flowers, which come in shades of pink, white, and purple. Catharanthus is used in traditional medicine to treat various ailments, including diabetes and cancer.",
    "Chakte": "Chakte, scientifically known as Caesalpinia platyloba, is a species of flowering plant native to Mexico and Central America. It is a small tree valued for its dense, durable wood, which is used in woodworking and furniture making. Chakte is also grown as an ornamental plant for its bright yellow flowers.",
    "Chilly": "Chilly, also known as Capsicum annuum, is a species of pepper native to the Americas. It is grown for its fruits, which vary in size, shape, color, and level of spiciness. Chilies are widely used in cooking to add heat and flavor to dishes.",
    "Citron lime (herelikai)": "Citron lime, also known as Citrus medica var. sarcodactylis or fingered citron, is a citrus fruit with a unique finger-like shape. It is cultivated for its aromatic rind, which is used in cooking, perfumery, and traditional medicine. Citron lime is also prized for its decorative value.",
    "Coffee": "Coffee is a brewed beverage prepared from the roasted seeds of the Coffea plant, which belongs to the Rubiaceae family. It is one of the most popular beverages worldwide, valued for its stimulating effects due to its caffeine content. Coffee is cultivated in tropical and subtropical regions.",
    "Common rue(naagdalli)": "Common rue, also known as Ruta graveolens, is a herb native to the Mediterranean region. It is cultivated for its aromatic leaves and small yellow flowers. Common rue has a long history of use in traditional medicine and is also grown as an ornamental plant.",
    "Coriender": "Coriander, also known as Coriandrum sativum, is an annual herb native to regions spanning from southern Europe to North Africa and southwestern Asia. It is cultivated for its aromatic leaves and seeds, which are used as a spice in cooking and for their medicinal properties.",
    "Curry": "Curry plant, scientifically known as Helichrysum italicum, is a small perennial herb native to the Mediterranean region. It is valued for its aromatic leaves, which are used as a culinary herb to flavor dishes. Curry plant is also grown for its ornamental silver-gray foliage.",
    "Doddpathre": "Doddpathre, also known as Ajwain or Trachyspermum ammi, is an annual herbaceous plant native to the Indian subcontinent. It produces small umbels of white or pink flowers and aromatic seeds with a flavor similar to thyme. Doddpathre seeds are used as a spice in cooking and for their medicinal properties.",
    "Drumstick": "Drumstick, also known as Moringa oleifera, is a fast-growing tree native to the Indian subcontinent. It is valued for its nutritious leaves, pods, and seeds, which are used as food and in traditional medicine. Drumstick is cultivated in tropical and subtropical regions worldwide.",
    "Ekka": "Ekka, also known as Calotropis procera or apple of Sodom, is a species of flowering plant native to arid and semi-arid regions. It is a large shrub or small tree with thick, leathery leaves and clusters of white or purple flowers. Ekka is used in traditional medicine to treat various ailments, including asthma, dysentery, and skin conditions.",
    "Eucalyptus": "Eucalyptus is a genus of flowering trees and shrubs native to Australia and nearby islands. It is known for its aromatic leaves and oil, which have antiseptic and expectorant properties. Eucalyptus oil is used in aromatherapy, traditional medicine, and industrial applications.",
    "Ganigale": "Ganigale, also known as Vitex negundo or five-leaved chaste tree, is a large shrub or small tree native to the Indian subcontinent. It produces clusters of purple flowers and small black berries. Ganigale is valued in traditional medicine for its anti-inflammatory, analgesic, and antipyretic properties.",
    "Ganike": "Ganike, also known as Justicia adhatoda or Malabar nut, is a shrub native to South Asia. It produces clusters of white or purple flowers and small capsule fruits. Ganike is used in traditional medicine to treat respiratory conditions such as asthma, bronchitis, and coughs.",
    "Gasagase": "Gasagase, also known as Poppy seeds or Papaver somniferum, is an oilseed obtained from the opium poppy. It is used in cooking as a spice and as a source of edible oil. Gasagase seeds are also used in baking and confectionery.",
    "Ginger": "Ginger, scientifically known as Zingiber officinale, is a flowering plant native to Southeast Asia. It is valued for its rhizomes, which are used as a spice, flavoring agent, and traditional medicine. Ginger is known for its anti-inflammatory, antioxidant, and digestive properties.",
    "Globe Amarnath": "Globe Amaranth, also known as Gomphrena globosa, is a species of flowering plant native to Central and South America. It is cultivated for its round, brightly colored flower heads, which are used in dried flower arrangements and ornamental gardens.",
    "Guava": "Guava, also known as Psidium guajava, is a small tree native to tropical regions of America. It produces round or pear-shaped fruits with edible flesh and seeds. Guava fruits are rich in vitamin C and dietary fiber and are consumed fresh or processed into juices, jams, and desserts.",
    "Henna": "Henna, also known as Lawsonia inermis, is a flowering plant native to tropical and subtropical regions of Africa, Asia, and Australia. It is valued for its leaves, which contain lawsone, a natural dye used to create temporary tattoos and hair colorants.",
    "Hibiscus": "Hibiscus is a genus of flowering plants belonging to the Malvaceae family. It is known for its showy flowers, which come in a variety of colors and sizes. Hibiscus flowers are used in herbal teas, beverages, and traditional medicine.",
    "Honge": "Honge, also known as Pongamia pinnata or Indian beech, is a medium-sized tree native to India. It produces clusters of white, pink, or purple flowers followed by brown seed pods. Honge seeds yield oil used in biodiesel production and traditional medicine.",
    "Insulin": "Insulin plant, scientifically known as Costus igneus, is a medicinal plant native to Southeast Asia. It is characterized by its fleshy leaves and bright red inflorescence. Insulin plant is used in traditional medicine to lower blood sugar levels and manage diabetes.",
    "Jackfruit": "Jackfruit, scientifically known as Artocarpus heterophyllus, is a tropical tree native to southwest India. It produces large, oblong fruits with a distinctive sweet flavor and aroma. Jackfruit is consumed ripe as a fruit or unripe as a vegetable in various culinary dishes.",
    "Jasmine": "Jasmine is a genus of flowering plants native to tropical and subtropical regions of Eurasia, Australasia, and Oceania. It is known for its fragrant white or yellow flowers, which are used in perfumery, aromatherapy, and traditional medicine.",
    "Kambajala": "Kambajala, also known as Passiflora edulis or passion fruit vine, is a species of flowering plant native to South America. It produces round or oval fruits with a tough outer rind and juicy, aromatic flesh filled with edible seeds. Kambajala fruits are consumed fresh or processed into juices, jams, and desserts.",
    "Kasambruga": "Kasambruga, also known as Phyllanthus emblica or Indian gooseberry, is a small tree native to India. Its fruit, known as amla, is highly nutritious and is a rich source of vitamin C and antioxidants. Kasambruga is used in Ayurvedic medicine to improve digestion, boost immunity, and promote hair growth.",
    "Kohlrabi": "Kohlrabi, scientifically known as Brassica oleracea var. gongylodes, is a biennial vegetable cultivated for its edible stem. It resembles a turnip but has a sweeter, milder flavor. Kohlrabi is consumed raw or cooked and is valued for its high vitamin C and dietary fiber content.",
    "Lantana": "Lantana is a genus of flowering plants native to tropical and subtropical regions of the Americas and Africa. It is known for its clusters of small, brightly colored flowers, which attract butterflies and other pollinators. Lantana is grown as an ornamental plant but can be invasive in some regions.",
    "Lemon": "Lemon, scientifically known as Citrus limon, is a citrus fruit prized for its acidic juice and aromatic rind. It is used in cooking, baking, beverages, and as a flavoring agent. Lemon juice is also valued for its cleansing and medicinal properties.",
    "Lemongrass": "Lemongrass, also known as Cymbopogon citratus, is a tropical grass native to Southeast Asia. It is valued for its citrusy flavor and aroma, which is used to flavor culinary dishes, teas, and herbal infusions. Lemongrass is also used in traditional medicine for its anti-inflammatory and antimicrobial properties.",
    "Malabar_Nut": "Malabar Nut, also known as Justicia adhatoda or ganike, is a shrub native to South Asia. It produces clusters of white or purple flowers and small capsule fruits. Malabar Nut is used in traditional medicine to treat respiratory conditions such as asthma, bronchitis, and coughs.",
    "Malabar_Spinach": "Malabar Spinach, also known as Basella alba or vine spinach, is a tropical vine native to Asia and Africa. It produces succulent leaves that are cooked and eaten as a leafy green vegetable. Malabar Spinach is valued for its high vitamin and mineral content.",
    "Mango": "Mango, scientifically known as Mangifera indica, is a tropical fruit tree native to South Asia. It produces large, juicy fruits with a sweet, aromatic flavor and smooth, golden flesh. Mangoes are consumed fresh, dried, or processed into juices, jams, and desserts.",
    "Marigold": "Marigold, scientifically known as Tagetes, is a genus of flowering plants native to the Americas. It is valued for its showy flowers, which come in shades of yellow, orange, and red. Marigolds are grown as ornamental plants in gardens and landscapes and are also used in traditional medicine and religious ceremonies.",
    "Mint": "Mint, scientifically known as Mentha, is a genus of aromatic herbaceous plants native to Europe, Asia, and Africa. It is valued for its refreshing flavor and aroma, which is used to flavor culinary dishes, teas, and beverages. Mint is also used in traditional medicine for its digestive and respiratory benefits.",
    "Neem": "Neem, scientifically known as Azadirachta indica, is a fast-growing tree native to the Indian subcontinent. It is valued for its versatile properties and is used in agriculture, traditional medicine, and personal care products. Neem extracts have insecticidal, antifungal, antibacterial, and anti-inflammatory properties.",
    "Nelavembu": "Nelavembu, also known as Andrographis paniculata or green chiretta, is a medicinal herb native to South Asia. It is valued for its bitter-tasting leaves and stems, which are used in traditional medicine to boost immunity, treat fever, and alleviate respiratory conditions.",
    "Nerale": "Nerale, also known as Jamun or Syzygium cumini, is a fruit-bearing tree native to the Indian subcontinent. It produces small, purple-black berries with a sweet and tangy flavor. Nerale fruits are consumed fresh or processed into jams, jellies, juices, and desserts.",
    "Nooni": "Nooni, also known as Solanum nigrum or black nightshade, is a species of flowering plant native to Eurasia and North Africa. It produces small black berries and is valued in traditional medicine for its anti-inflammatory and antioxidant properties.",
    "Onion": "Onion, scientifically known as Allium cepa, is a bulbous vegetable cultivated worldwide for its edible bulb. It is used in cooking to add flavor and aroma to various dishes. Onions are also valued for their medicinal properties and are consumed raw, cooked, or processed into pickles, sauces, and powders.",
    "Padri": "Padri, also known as Clitoria ternatea or butterfly pea, is a climbing plant native to tropical regions of Asia and Africa. It produces striking blue flowers that are used to make natural food coloring and herbal tea. Padri flowers are also valued for their medicinal properties.",
    "Palak(Spinach)": "Palak, also known as Spinacia oleracea, is a leafy green vegetable native to Central and Western Asia. It is valued for its tender leaves, which are rich in vitamins, minerals, and antioxidants. Palak is consumed cooked as a nutritious vegetable or raw in salads and smoothies.",
    "Papaya": "Papaya, scientifically known as Carica papaya, is a tropical fruit tree native to Central America and southern Mexico. It produces large, oblong fruits with sweet, orange flesh and black seeds. Papayas are consumed fresh or processed into juices, jams, and desserts.",
    "Parijatha": "Parijatha, also known as Nyctanthes arbor-tristis or night-flowering jasmine, is a species of flowering plant native to South Asia. It produces clusters of fragrant white flowers with orange centers, which bloom at night and are used in traditional medicine and religious ceremonies.",
    "Pea": "Pea, scientifically known as Pisum sativum, is a cool-season annual legume cultivated for its edible seeds. Peas come in various types, including garden peas, snow peas, and snap peas, each with distinct culinary uses. Peas are valued for their high protein and fiber content.",
    "Pepper": "Pepper, also known as Piper nigrum, is a flowering vine native to South Asia. It produces small spherical fruits known as peppercorns, which are dried and used as a spice and seasoning. Pepper is valued for its pungent flavor and is one of the most widely used spices worldwide.",
    "Pomoegranate": "Pomegranate, scientifically known as Punica granatum, is a fruit-bearing shrub or small tree native to the Mediterranean region. It produces round fruits with a tough outer rind and juicy, edible seeds surrounded by red arils. Pomegranates are consumed fresh or processed into juices, sauces, and desserts.",
    "Pumpkin": "Pumpkin, scientifically known as Cucurbita pepo, is a winter squash native to North America. It produces large, round fruits with orange or yellow flesh and seeds. Pumpkins are consumed cooked as a vegetable or processed into pies, soups, and other culinary dishes.",
    "Raddish": "Radish, scientifically known as Raphanus sativus, is an edible root vegetable cultivated worldwide for its crisp, peppery-tasting roots. Radishes come in various shapes, sizes, and colors, with common varieties including red, white, and black radishes. Radishes are consumed raw in salads, pickled, or cooked in various dishes.",
    "Rose": "Rose is a genus of flowering plants belonging to the Rosaceae family. It is known for its showy flowers, which come in a variety of colors and fragrances. Roses are grown worldwide for their ornamental value, as well as for their use in perfumery, cosmetics, and traditional medicine.",
    "Sampige": "Sampige, also known as Michelia champaca or champak, is a flowering tree native to South Asia. It produces clusters of highly fragrant yellow or orange flowers, which are used in perfumery and religious ceremonies. Sampige is also valued for its timber and medicinal properties.",
    "Sapota": "Sapota, also known as Manilkara zapota or chikoo, is a tropical fruit tree native to Mexico and Central America. It produces round or oval fruits with sweet, grainy flesh and black seeds. Sapotas are consumed fresh or processed into juices, jams, and desserts.",
    "Seethaashoka": "Seethaashoka, also known as Saraca asoca or Ashoka tree, is a small evergreen tree native to South Asia. It produces clusters of fragrant orange-yellow flowers, which are used in traditional medicine and religious ceremonies. Seethaashoka is also grown as an ornamental tree in gardens and landscapes.",
    "Seethapala": "Seethapala, also known as Annona squamosa or sugar apple, is a tropical fruit tree native to the Americas. It produces round or heart-shaped fruits with sweet, custard-like flesh and black seeds. Seethapala fruits are consumed fresh or processed into juices, smoothies, and desserts.",
    "Spinach1": "Spinach, scientifically known as Spinacia oleracea, is a leafy green vegetable native to Central and Western Asia. It is valued for its tender leaves, which are rich in vitamins, minerals, and antioxidants. Spinach is consumed cooked as a nutritious vegetable or raw in salads and smoothies.",
    "Tamarind": "Tamarind, also known as Tamarindus indica, is a tropical tree native to Africa. It produces pods containing sticky pulp with a sweet and sour flavor. Tamarind pulp is used as a flavoring agent in cooking, beverages, and traditional medicine.",
    "Taro": "Taro, scientifically known as Colocasia esculenta, is a tropical plant native to Southeast Asia and the Indian subcontinent. It produces large, starchy tubers that are consumed cooked as a vegetable. Taro leaves are also edible and used in cooking.",
    "Tecoma": "Tecoma, also known as Tecoma stans or yellow trumpetbush, is a species of flowering plant native to the Americas. It produces clusters of bright yellow trumpet-shaped flowers and is grown as an ornamental shrub in gardens and landscapes.",
    "Thumbe": "Thumbe, also known as Leucas aspera or white thistle, is a medicinal herb native to South Asia. It produces clusters of small white flowers and is used in traditional medicine to treat various ailments, including fever, cough, and skin conditions.",
    "Tomato": "Tomato, scientifically known as Solanum lycopersicum, is a fruit-bearing plant native to western South America. It produces red, yellow, or orange fruits with juicy flesh and edible seeds. Tomatoes are consumed raw in salads, sandwiches, and sauces or cooked in various dishes.",
    "Tulsi": "Tulsi, also known as Ocimum tenuiflorum or holy basil, is a sacred plant in Hinduism and is native to the Indian subcontinent. It is valued for its medicinal properties and is used in Ayurvedic medicine to promote longevity, boost immunity, and alleviate stress.",
    "Turmeric": "Turmeric, scientifically known as Curcuma longa, is a flowering plant native to South Asia. It produces rhizomes that are dried and ground into a bright yellow powder, which is used as a spice and coloring agent in cooking, cosmetics, and traditional medicine.",
    "ashoka": "Ashoka, also known as Saraca asoca or Seethaashoka, is a small evergreen tree native to South Asia. It produces clusters of fragrant orange-yellow flowers, which are used in traditional medicine and religious ceremonies. Ashoka is also grown as an ornamental tree in gardens and landscapes.",
    "camphor": "Camphor tree, scientifically known as Cinnamomum camphora, is a large evergreen tree native to East Asia. It produces waxy white crystals of camphor, which are used in cooking, medicine, and religious ceremonies. Camphor is valued for its aromatic and medicinal properties.",
    "kamakasturi": "Kamakasturi, also known as Abelmoschus moschatus or musk mallow, is a flowering plant native to India. It produces yellow flowers with a musky fragrance and is cultivated for its seeds, which are used in perfumery and traditional medicine.",
    "kepala": "Kepala, also known as Moringa oleifera or drumstick tree, is a fast-growing tree native to the Indian subcontinent. It is valued for its nutritious leaves, pods, and seeds, which are used as food and in traditional medicine. Kepala is cultivated in tropical and subtropical regions worldwide."
  }
  